MDK-Packs/CB_Lab4Layer/layer/Board/LPCXpresso55S69/RTE/Board_Support/LPC55S69JBD100_cm33_core0/pin_mux.h
/*! @name PIO1_31 (number 91), P19[7]/P19[8]/PLU_IN0/GPIO
  @{ */
#define BOARD_INITI2SPINS_MCLK_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITI2SPINS_MCLK_PIN 31U /*!<@brief 1U pin index: 31 */
                                       /* @} */

/*! @name PIO0_21 (number 76), P17[14]/FC7_I2S_SCK
  @{ */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_PIN 21U /*!<@brief 0U pin index: 21 */
                                              /* @} */

/*! @name PIO0_20 (number 74), P17[10]/FC7_I2S_TX
  @{ */
#define BOARD_INITI2SPINS_FC7_I2S_TX_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITI2SPINS_FC7_I2S_TX_PIN 20U /*!<@brief 0U pin index: 20 */
                                             /* @} */

/*! @name PIO0_19 (number 90), P17[12]/FC7_I2S_WS
  @{ */
#define BOARD_INITI2SPINS_FC7_I2S_WS_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITI2SPINS_FC7_I2S_WS_PIN 19U /*!<@brief 0U pin index: 19 */
                                             /* @} */

/*! @name PIO0_10 (number 21), U14[12]/SWO_TRGT
  @{ */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_PIN 10U /*!<@brief 0U pin index: 10 */
                                              /* @} */

/*! @name PIO1_13 (number 2), P17[20]/FC6_I2S_RX
  @{ */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PIN 13U /*!<@brief 1U pin index: 13 */
                                             /* @} */

/*! @name PIO1_16 (number 87), P18[17]/SD1_PWR_EN
  @{ */
#define BOARD_INITI2SPINS_FC6_I2S_WS_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITI2SPINS_FC6_I2S_WS_PIN 16U /*!<@brief 1U pin index: 16 */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_ASW_DI 0x00u        /*!<@brief Analog switch is open (disabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC5 0x05u         /*!<@brief Selects pin function 5 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PIN 21U /*!<@brief 1U pin index: 21 */
                                                /* @} */

/*! @name PIO1_20 (number 4), P17[1]/P24[5]/FC4_I2C_SCL_ARD
  @{ */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PIN 20U /*!<@brief 1U pin index: 20 */
                                                /* @} */

/*! @name PIO1_19 (number 58), U7[3]/P18[14]/PLU_OUT1/GPIO
  @{ */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITACCELPINS_ACCL_INTR_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN 19U   /*!<@brief 1U pin index: 19 */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_26_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO0_26_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_1_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 0. */
#define PIO1_1_FUNC_ALT0 0x00u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_1_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_2_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 6. */
#define PIO1_2_FUNC_ALT6 0x06u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_2_SLEW_FAST 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_3_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 6. */
#define PIO1_3_FUNC_ALT6 0x06u
/*!
 * @brief
 * Driver slew rate.
 * : Fast-mode, output slew rate is faster.
 * Refer to the appropriate specific device data sheet for details.
 */
#define PIO1_3_SLEW_FAST 0x01u

/*! @name PIO1_2 (number 61), P17[9]/P23[4]/LSPI_HS_SCK
  @{ */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SCK_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SCK_PIN 2U  /*!<@brief 1U pin index: 2 */
                                                            /* @} */

/*! @name PIO1_3 (number 62), P17[11]/P23[5]/LSPI_HS_MISO
  @{ */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MISO_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MISO_PIN 3U  /*!<@brief 1U pin index: 3 */
                                                             /* @} */

/*! @name PIO0_26 (number 60), P17[13]/P23[6]/LSPI_HS_MOSI
  @{ */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MOSI_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_MOSI_PIN 26U /*!<@brief 0U pin index: 26 */
                                                             /* @} */

/*! @name PIO1_1 (number 59), P17[15]/P23[3]/LSPI_HS_SSEL1
  @{ */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_ARDUINO_SPI8_ARDUINO_SPI_SSN_PIN 1U    /*!<@brief 1U pin index: 1 */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features for SPI on 
 * Arduino UNO R3 connectors.
 *
 */
void BOARD_InitPins_Arduino_SPI8(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define PIO1_5_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_5_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO1_5 (number 31), P17[17]/P24[1]/PIO1_5_GPIO_ARD
  @{ */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_GPIO GPIO /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_PORT 1U   /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_ARDUINO_PIO1_5_ARDUINO_PIO1_5_PIN 5U    /*!<@brief 1U pin index: 5 */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features for PIO1_5 pin on 
 * Arduino UNO R3 connectors, used by 
 * 
 * 
 * 
 * 
 * 
 * 
 * Inventek ISM43362 WiFi Shield (DATARDY).
 *
 */
void BOARD_InitPins_Arduino_PIO1_5(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_27_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_27_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_24_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO1_24_FUNC_ALT1 0x01u

/*! @name PIO0_27 (number 27), P18[13]/P24[4]/FC2_USART_TXD_ARD
  @{ */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_TX_PORT 0U /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_TX_PIN 27U /*!<@brief 0U pin index: 27 */
                                                               /* @} */

/*! @name PIO1_24 (number 3), P18[15]/P18[10]/P24[3]/PLU_OUT6/GPIO/FC2_USART_RXD_ARD/SD1_D1
  @{ */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_RX_PORT 1U /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_ARDUINO_USART2_ARDUINO_USART_RX_PIN 24U /*!<@brief 1U pin index: 24 */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features for USART on 
 * Arduino UNO R3 connectors.
 *
 */
void BOARD_InitPins_Arduino_USART2(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
